# specify a directory to install
cask_args appdir: '/Applications'
# install packages
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'dart-lang/dart'
tap 'jesseduffield/lazydocker'
tap 'homebrew/cask-fonts'

brew 'ack'
brew 'aria2'
brew 'asdf'
brew 'autoconf'
brew 'automake'
brew 'ammonite-repl'
brew 'avro-tools'
brew 'aws-iam-authenticator'
brew 'awscli'
#brew 'cocoapods'
brew 'consul-template'
brew 'coreutils'
#brew 'dart'
brew 'dep'
brew 'docker-compose'
brew 'enscript'
brew 'ffmpeg'
brew 'flyway'
brew 'fzf'
brew 'gettext'
brew 'git'
brew 'git-extras'
brew 'git-secrets'
brew 'glances'
brew 'gnupg'
brew 'go'
brew 'gobject-introspection'
brew 'gradle'
brew 'graphviz'
brew 'harfbuzz'
brew 'helm'
brew 'htop'
brew 'hub'
brew 'imagemagick'
brew 'ipython'
brew 'jsonlint'
brew 'jq'
brew 'lazydocker'
brew 'lazygit'
brew 'libksba'
brew 'libxmlsec1'
brew 'libssh2'
brew 'libyaml'
brew 'links'
brew 'kafka'
brew 'kubernetes-cli'
brew 'kops'
brew 'mas'
brew 'maven'
brew 'mcrypt'
brew 'midnight-commander'
brew 'minikube'
brew 'mpv'
brew 'mtr'
#brew 'mysql', restart_service: true
brew 'ncdu'
brew 'nmap'
brew 'nvm'
brew 'openssl'
brew 'packer'
brew 'parquet-tools'
#brew 'pdftk-java'
brew 'pixman'
brew 'postgres', restart_service: true
#brew 'pushpin', restart_service: true
brew 'python'
brew 'pyqt'
brew 'pyenv-virtualenv'
brew 'pv'
brew 'pwgen'
brew 'readline'
brew 'ruby'
brew 'scala@2.11'
brew 'sbt'
brew 'scrcpy'
brew 'snzip'
brew 'spark'
brew 'speedtest_cli'
brew 'telnet'
brew 'terraform'
brew 'terragrunt'
brew 'tig'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'websocat'
brew 'wget'
brew 'xvid'
brew 'xz'
brew 'youtube-dl'
brew 'zeromq'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'zplug'

cask '1password'
cask 'acorn'
cask 'adoptopenjdk8'
cask 'airflow'
cask 'alfred'
cask 'android-file-transfer'
cask 'android-studio'
cask 'atext'
cask 'calibre'
cask 'cyberduck'
cask 'datagrip'
cask 'disk-inventory-x'
cask 'docker'
cask 'dropbox'
cask 'epic-games'
cask 'fantastical'
cask 'firefox'
#cask 'flutter'
cask 'flux'
cask 'font-hack-nerd-font'
cask 'fork'
cask 'github'
cask 'go2shell'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'intellij-idea'
cask 'intel-haxm'
cask 'iterm2'
cask 'java'
cask 'kodi'
cask 'licecap'
cask 'phoenix-slides'
cask 'postman'
cask 'pycharm'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'quitter'
#cask 'rambox'
cask 'retroarch-metal'
cask 'scapple'
cask 'send-to-kindle'
#cask 'skitch'
#cask 'skype-for-business'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'steam'
cask 'suspicious-package'
cask 'tomighty'
cask 'telegram'
cask 'ubersicht'
cask 'vagrant'
cask 'vagrant-manager'
cask 'viscosity'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'webex-meetings'
cask 'webpquicklook'
cask 'webstorm'
cask 'yacreader'
cask 'zoomus'
#cask 'cheatsheet'

mas 'Affinity Photo', id: 824183456
mas 'Amphetamine', id: 937984704
#mas 'Annotate', id: 918207447
mas 'Clocker', id: 1056643111
mas 'Dropzone 3', id: 695406827
mas 'FruitJuice', id: 671736912
mas 'Keynote', id: 409183694
mas 'Kindle', id: 405399194
mas 'Numbers', id: 409203825
mas 'Magnet', id: 441258766
mas 'Pages', id: 409201541
mas 'PDF Signer', id: 428271079
mas 'Pocket', id: 568494494
mas 'PopClip', id: 445189367
mas 'ScreenFloat', id: 414528154
#mas 'Slack', id: 803453959
#mas 'Spark', id: 1176895641
mas 'The Unarchiver', id: 425424353
mas 'Todoist', id: 585829637
mas 'Xcode', id: 497799835
mas 'Yoink', id: 457622435

# exec 'softwareupdate -i -a'
