# specify a directory to install
cask_args appdir: '/Applications'
# install packages
tap 'caskroom/cask'
tap "homebrew/bundle"
tap "homebrew/core"

brew 'ack'
brew "aria2"
brew 'autoconf'
brew 'automake'
brew "awscli"
brew "consul-template"
brew 'coreutils'
brew 'ffmpeg'
brew 'fzf'
brew "gettext"
brew "git"
brew 'glances'
brew "go"
brew "gobject-introspection"
brew "harfbuzz"
brew "htop"
brew "hub"
brew "imagemagick"
brew "jsonlint"
brew 'libksba'
brew "libssh2"
brew 'libyaml'
brew 'links'
brew "mas"
brew "maven"
brew "midnight-commander"
brew "mpv"
brew "mtr"
brew "mysql", restart_service: true
brew "ncdu"
brew 'nmap'
brew "nvm"
brew "openssl"
brew "packer"
brew "pixman"
brew 'python'
brew 'python@2'
brew "pyqt"
brew "pwgen"
brew "readline"
brew 'speedtest_cli'
brew 'telnet'
brew 'tig'
brew "the_silver_searcher"
brew 'tmux'
brew 'tree'
brew "unrar"
brew "wget"
brew "xvid"
brew "xz"
brew 'youtube-dl'
brew "zeromq"
brew "zsh"
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew "zsh-syntax-highlighting"


cask '1password'
cask 'alfred'
cask 'android-file-transfer'
cask "appcleaner"
cask 'atext'
cask 'bartender'
cask 'calibre'
cask 'dash'
cask 'datagrip'
cask 'disk-inventory-x'
cask 'docker'
cask 'dropbox'
cask 'fantastical'
cask 'firefox'
cask 'flux'
cask 'go2shell'
cask "google-chrome"
cask 'intellij-idea'
cask 'iterm2'
cask 'java'
cask 'kindle'
cask "licecap"
cask "muzzle"
cask 'ngrok'
cask 'numi'
cask 'pycharm'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask "quitter"
cask "rambox"
cask 'send-to-kindle'
cask 'skitch'
cask 'sourcetree'
cask 'spotify'
cask "steam"
cask 'suspicious-package'
cask 'tomighty'
#cask "vagrant"
#cask "vagrant-manager"
cask "viscosity"
#cask 'virtualbox'
cask 'visual-studio-code'
cask 'vivaldi'
cask 'vlc'
cask 'webpquicklook'
cask 'webstorm'
cask "zoomus"
#cask 'cheatsheet'

mas 'Affinity Photo', id: 824183456
mas 'Amphetamine', id: 937984704
mas 'Annotate', id: 918207447
mas 'Clocker', id: 1056643111
mas 'Dropzone 3', id: 695406827
mas 'EasyRes', id: 688211836
mas 'FruitJuice', id: 671736912
mas 'Keynote', id: 409183694
mas 'Kindle', id: 405399194
mas 'Numbers', id: 409203825
mas 'Magnet', id: 441258766
mas 'Miniplay', id: 936243210
mas 'Pages', id: 409201541
mas 'PDF Signer', id: 428271079
mas 'Pocket', id: 568494494
mas 'PopClip', id: 445189367
mas 'ScreenFloat', id: 414528154
mas 'Slack', id: 803453959
mas 'Spark', id: 1176895641
mas 'The Unarchiver', id: 425424353
mas 'Todoist', id: 585829637
mas 'Xcode', id: 497799835
mas 'Yoink', id: 457622435

# exec "softwareupdate -i -a"
